Repository: aagedal/Aagedal-Media-Converter
Catalog: Aagedal Media Converter/Resources/Localizable.xcstrings
Source language: en
Languages: nb

source: Tip: During camera card import, choose Review recording-date groups… to organize clips by recording date.
nb: Tips: Ved import av kamerakort kan du velge Se gjennom grupper etter opptaksdato … for å organisere klippene etter opptaksdato.

source: Tip: Hold Option when clicking Reset to reverse the reset behavior chosen in General settings.
nb: Tips: Hold Option når du klikker Tilbakestill for å gjøre det motsatte av tilbakestillingsvalget i de generelle innstillingene.

source: Tip: Hold Option while resizing the crop box to scale it from its center. Hold Shift to lock its aspect ratio.
nb: Tips: Hold Option mens du endrer størrelsen på beskjæringsrammen for å skalere fra midten. Hold Shift for å låse sideforholdet.

source: Tip: If a website download fails, check for app-managed yt-dlp updates in Downloads settings, then retry.
nb: Tips: Hvis nedlasting fra en nettside mislykkes, se etter oppdateringer for appens yt-dlp i nedlastingsinnstillingene og prøv igjen.

source: Tip: Import files with ⌘I, and start converting with ⌘Enter.
nb: Tips: Importer filer med ⌘I, og start konvertering med ⌘Enter.

source: Tip: In Audio Routing, Control + M toggles mute and ⌘1–8 toggles individual source tracks.
nb: Tips: I lydruting slår Control + M lyden av eller på, mens ⌘1–8 slår individuelle kildespor av eller på.

source: Tip: In Crop mode, use ⌘1–9 to select an aspect ratio and ⌘0 to reset the crop.
nb: Tips: I beskjæringsmodus velger ⌘1–9 et sideforhold, og ⌘0 tilbakestiller beskjæringen.

source: Tip: In Crop mode, ⌘arrow keys move the crop box; ⌘+ and ⌘- resize it.
nb: Tips: I beskjæringsmodus flytter ⌘piltaster beskjæringsrammen, mens ⌘+ og ⌘- endrer størrelsen.

source: Tip: In either player, J starts reverse playback, K toggles playback, and L fast-forwards.
nb: Tips: I begge avspillerne starter J avspilling bakover, K starter eller pauser avspillingen, og L spoler fremover.

source: Tip: In either player, prefix a number with + or - to seek forward or backward in seconds, or in frames when the frame counter is active.
nb: Tips: I begge avspillerne kan du skrive + eller - foran et tall for å hoppe fremover eller bakover i sekunder, eller i bilderuter når bildetelleren er aktiv.

source: Tip: In either player, press T to switch between relative timecode, source timecode, and the frame counter.
nb: Tips: I begge avspillerne bytter T mellom relativ tidskode, kildetidskode og bildetelleren.

source: Tip: In either player, press ⌘S to save a still image of the current frame.
nb: Tips: I begge avspillerne lagrer ⌘S et stillbilde av den gjeldende bilderuten.

source: Tip: In either player, type a timecode and press Return to jump to that position.
nb: Tips: I begge avspillerne kan du skrive en tidskode og trykke Return for å hoppe til den posisjonen.

source: Tip: In either player, ← and → step one frame; ↑ and ↓ jump ten frames.
nb: Tips: I begge avspillerne flytter ← og → én bilderute, mens ↑ og ↓ hopper ti bilderuter.

source: Tip: In fullscreen, press A to toggle Auto Next and play through the queue automatically.
nb: Tips: I fullskjerm slår A automatisk neste av eller på, slik at køen spilles av automatisk.

source: Tip: In fullscreen, use ⌘N for the next video and ⌘B for the previous video in the queue.
nb: Tips: I fullskjerm går ⌘N til neste video og ⌘B til forrige video i køen.

source: Tip: In the trim timeline, hold Shift and drag between the trim points to move the entire trim range.
nb: Tips: Hold Shift og dra mellom trimpunktene i trimtidslinjen for å flytte hele trimområdet.

source: Tip: In the trim timeline, hold ⌘ and drag to set both in and out points in one gesture.
nb: Tips: Hold ⌘ og dra i trimtidslinjen for å sette både inn- og utpunkt i én bevegelse.

source: Tip: Move the pointer to the right edge of the fullscreen player to hide its overlay while away from the playback controls.
nb: Tips: Flytt pekeren til høyrekanten av fullskjermavspilleren, utenfor avspillingskontrollene, for å skjule kontrollaget.

source: Tip: Press Control + D to toggle the date tag on the selected item.
nb: Tips: Trykk på Control + D for å veksle datomerket på det valgte elementet.

source: Tip: Press Control + K to see all keyboard shortcuts.
nb: Tips: Trykk Control + K for å se alle tastatursnarveier.

source: Tip: Press Control + M to toggle mute on the selected queue items.
nb: Tips: Trykk Control + M for å slå lyden av eller på for de valgte køelementene.

source: Tip: Press Control + R to load a different tip here.
nb: Tips: Trykk Control + R for å vise et annet tips her.

source: Tip: Press Tab or Shift + Tab to move between visible comment fields in the queue.
nb: Tips: Trykk Tab eller Shift + Tab for å flytte mellom synlige kommentarfelt i køen.

source: Tip: Press ⌘D to download a video from a URL.
nb: Tips: Trykk ⌘D for å laste ned en video fra en nettadresse.

source: Tip: Press ⌘F to play the selected video in fullscreen.
nb: Tips: Trykk ⌘F for å spille av den valgte videoen i fullskjerm.

source: Tip: Press ⌘N to create an encoding group with its own preset and clip settings.
nb: Tips: Trykk ⌘N for å opprette en konverteringsgruppe med egen forhåndsinnstilling og egne klippinnstillinger.

source: Tip: Press ⌘P to open the preset selector.
nb: Tips: Trykk ⌘P for å åpne forhåndsinnstillingsvelgeren.

source: Tip: Press ⌘⇧C to open screen capture and record a screen, window, or selected region.
nb: Tips: Trykk ⌘⇧C for å åpne skjermopptak og ta opp en skjerm, et vindu eller et valgt område.

source: Tip: Set up a Watch Folder in Settings to automatically import new files.
nb: Tips: Opprett en overvåkingsmappe i Innstillinger for å automatisk importere nye filer.

source: Tip: Use File > Import Camera Card… (⌘⇧I) to scan a memory card or folder for video clips.
nb: Tips: Bruk Fil > Importer kamerakort … (⌘⇧I) for å søke etter videoklipp på et minnekort eller i en mappe.

source: Tip: Use Option + A to configure audio routing for the selected file.
nb: Tips: Bruk Alternativ + A for å konfigurere lydruting for den valgte filen.

source: Tip: Use Option + I to inspect metadata. Select several files to compare their metadata.
nb: Tips: Bruk Option + I for å se metadata. Velg flere filer for å sammenligne metadataene.

source: Tip: Use ⌘1–9 to select a visible preset; ⌘0 selects the tenth preset.
nb: Tips: Bruk ⌘1–9 for å velge en synlig forhåndsinnstilling. ⌘0 velger den tiende.

source: Tip: Use ⌘T to open the trim editor for the selected file.
nb: Tips: Bruk ⌘T for å åpne trim-redigereren for den valgte filen.

source: Tip: Use ⌘↑ and ⌘↓ to move selected items up and down in the queue.
nb: Tips: Bruk ⌘↑ og ⌘↓ for å flytte valgte elementer opp og ned i køen.

source: Tip: With Auto Next enabled in fullscreen, press ⌘L to loop the entire queue.
nb: Tips: Når automatisk neste er på i fullskjerm, gjentar ⌘L hele køen.

source: Tip: You can drag items to reorder them in the queue.
nb: Tips: Du kan dra elementer for å endre rekkefølgen i køen.

source: Tip: You have Homebrew yt-dlp installed. Select "Homebrew" above for faster download startup.
nb: Tips: Du har Homebrew yt-dlp installert. Velg «Homebrew» ovenfor for raskere oppstart av nedlasting.

source: Title shown by IMF players
nb: Tittel som vises i IMF-spillere

source: Title shown on cinema server
nb: Tittel som vises på kinoserver

source: To download videos from URLs, you need yt-dlp. Install with Homebrew (brew install yt-dlp) or configure a custom path in Settings > Downloads.
nb: For å laste ned videoer fra nettadresser, trenger du yt-dlp. Installer med Homebrew (brew install yt-dlp) eller konfigurer en egendefinert bane i Innstillinger > Nedlastinger.

source: To install via Homebrew, run this in Terminal:
nb: For å installere via Homebrew, kjør dette i Terminal:

source: Toggle audio meter
nb: Vis eller skjul lydmåleren

source: Toggle Auto Next mode
nb: Slå automatisk neste av eller på

source: Toggle auto-encode on selected items
nb: Slå automatisk koding av eller på for valgte elementer

source: Toggle crop controls (C)
nb: Veksle beskjæringskontroller (C)

source: Toggle fullscreen
nb: Slå fullskjerm av eller på

source: Toggle individual audio track (1-8)
nb: Slå individuelle lydspor av eller på (1–8)

source: Toggle loop mode
nb: Slå gjentakelse av eller på

source: Toggle Loop Queue (requires Auto Next)
nb: Slå køgjentakelse av eller på (krever automatisk neste)

source: Toggle merging of clips
nb: Slå sammenslåing av klipp av eller på

source: Toggle metadata date tag on selected items
nb: Slå datomerking fra metadata av eller på for valgte elementer

source: Toggle mute audio
nb: Slå lyddemping av eller på

source: Toggle mute on selected items
nb: Slå lyddemping av eller på for valgte elementer

source: Toggle play/pause
nb: Veksle mellom avspilling og pause

source: Toggle playback
nb: Veksle mellom avspilling og pause

source: Toggle Range mode (R), or hold Command while dragging across a clip to select a range. Backspace deletes it; Option+X or Escape clears it.
nb: Slå områdemodus av eller på (R), eller hold ⌘ mens du drar over et klipp for å velge et område. Slettetasten sletter området; ⌥X eller Escape fjerner markeringen.

source: Toggle Range mode (R), or hold Command while dragging across a clip to select a range. Backspace deletes the selected range or clips; Option+X or Escape clears a range.
nb: Slå på områdemodus (R), eller hold nede Kommando mens du drar over et klipp for å velge et område. Slettetasten sletter det valgte området eller klippene; ⌥X eller Escape opphever områdevalget.

source: Toggle source file upload on selected items
nb: Slå opplasting av kildefiler av eller på for valgte elementer

source: Toggle stereo for all surround tracks
nb: Slå stereo av eller på for alle surroundspor

source: Toggle stereo for output track position
nb: Slå stereo av eller på for utsporets plassering

source: Toggle timecode display mode
nb: Bytt visningsmodus for tidskode

source: Toggle timecode mode
nb: Bytt tidskodemodus

source: Toggle transcription on selected items
nb: Slå transkripsjon av eller på for valgte elementer

source: Toggle upload on selected items
nb: Slå opplasting av eller på for valgte elementer

source: Toggle watch folder
nb: Slå Watch Folder av eller på

source: Tool Diagnostics
nb: Verktøydiagnostikk

source: Total size: %@
nb: Total størrelse: %@

source: Track
nb: Spor

source: Transcription
nb: Transkripsjon

source: Transcription enabled — SRT will be created after encoding
nb: Transkripsjon på – SRT lages etter koding

source: Transparency
nb: Gjennomsiktighet

source: Trim clip
nb: Trim klipp

source: Trim end
nb: Sluttpunkt

source: Trim end: %@ s
nb: Sluttpunkt: %@ s

source: Trim in for %@
nb: Trimmens innpunkt for %@

source: Trim out for %@
nb: Trimmens utpunkt for %@

source: Trim start
nb: Startpunkt

source: Trim start: %@ s
nb: Startpunkt: %@ s

source: Trim View – Navigation
nb: Trimvisning – navigering

source: Trim View – Playback
nb: Trimvisning – avspilling

source: Trim View – Timecode Input
nb: Trimvisning – tidskodeinntasting

source: Trim View – Timeline Modifiers
nb: Trimvisning – modifikatortaster for tidslinjen

source: Trim View – Tools
nb: Trimvisning – verktøy

source: Trimmed
nb: Trimmet

source: Trims and ranges snap to scanned keyframes. Keyframe ticks appear on the clip.
nb: Trimming og områder festes til skannede nøkkelbilder. Nøkkelbildemarkeringer vises på klippet.

source: Trims and ranges snap to the nearest available keyframe.
nb: Trimpunkter og områder festes til nærmeste tilgjengelige nøkkelbilde.

source: Turning access off rejects new connections. Jobs already accepted by the app continue and remain available in job history.
nb: Når tilgangen slås av, avvises nye tilkoblinger. Jobber som appen allerede har godtatt, fortsetter og forblir tilgjengelige i jobbhistorikken.

source: Undo timeline edit
nb: Angre tidslinjeredigering

source: Undo timeline edit (⌘Z)
nb: Angre tidslinjeredigering (⌘Z)

source: Unknown
nb: Ukjent

source: Updates
nb: Oppdateringer

source: Upload
nb: Opplasting

source: Upload after conversion
nb: Last opp etter konvertering

source: Upload Behavior
nb: Opplastningsoppførsel

source: Upload complete
nb: Opplasting fullført

source: Upload enabled — files will upload after encoding
nb: Opplasting på – filer lastes opp etter koding

source: Upload failed
nb: Opplasting mislyktes

# Upload failed %lld/%lld
source: Upload failed %1$lld/%2$lld
nb: Opplasting mislyktes %1$lld/%2$lld

source: Upload not configured
nb: Opplastning ikke konfigurert

source: Upload pending
nb: Opplasting venter

# Upload pending %lld/%lld
source: Upload pending %1$lld/%2$lld
nb: Opplasting venter %1$lld/%2$lld

source: Upload Profile
nb: Opplastingsprofil

# Uploaded %lld/%lld
source: Uploaded %1$lld/%2$lld
nb: Lastet opp %1$lld/%2$lld

# Uploading %lld/%lld%@
source: Uploading %1$lld/%2$lld%3$@
nb: Laster opp %1$lld/%2$lld%3$@

source: URL Input Overlay
nb: URL-inntasting

source: us-east-1 (N. Virginia)
nb: us-east-1 (Nord-Virginia)

source: us-west-1 (N. California)
nb: us-west-1 (Nord-California)

source: Use 'Auto-detect' for mixed-language content. Specifying a language can improve accuracy for single-language audio.
nb: Bruk «Auto-detect» for innhold med blandede språk. Ved å spesifisere et språk kan nøyaktigheten forbedres for lydopptak med ett enkelt språk.

source: Use a custom GGML model file.
nb: Bruk en egendefinert GGML-modellfil.

source: Use background gradient
nb: Bruk bakgrunnsgradient

source: Use browser cookies to access age-restricted, private, or member-only content.
nb: Bruk informasjonskapsler fra nettleseren for å få tilgang til innhold som er aldersbegrenset, privat eller kun for medlemmer.

source: Use compact list view
nb: Bruk kompakt listevisning

source: Use custom filename template
nb: Bruk egendefinert filnavnmal

source: Use foreground gradient
nb: Bruk forgrunnsgradient

source: Use FTPS (TLS encryption)
nb: Bruk FTPS (TLS-kryptering)

source: Use preset suffix
nb: Bruk forhåndsinnstilt suffiks

source: Use ProRes
nb: Bruk ProRes

source: Use selected format (discard alpha if unsupported)
nb: Bruk valgt format (forkast alfa hvis det ikke støttes)

source: Use the + button to add tracks
nb: Bruk +-knappen for å legge til spor

source: Use TV AVC-Intra
nb: Bruk TV AVC-Intra

source: Used when the source has no MCA labels and no per-track override is set. Choose 'None' to leave the audio essence unlabelled.
nb: Brukes når kilden ikke har MCA-merkelapper og ingen overstyring per spor er satt. Velg «Ingen» for å la lydessensen være umerket.

source: Username
nb: Brukernavn

source: Using a minimal rclone build shipped with the app, trimmed to only the backends this app needs.
nb: Bruker en minimal rclone-build som leveres med appen, redusert til kun de bakdelene appen trenger.

source: Using the rclone installed via Homebrew at /opt/homebrew/bin/rclone.
nb: Bruker rclone installert via Homebrew på /opt/homebrew/bin/rclone.

source: Variable frame rate (VFR): the selected rate is a maximum; static screens may produce fewer frames.
nb: Variabel bildefrekvens (VFR): valgt bildefrekvens er en øvre grense; statiske skjermbilder kan gi færre bilder.

source: Variance Boost
nb: Varians-boost

source: Variance Boost Curve
nb: Varians-boost-kurve

source: Verification Resources
nb: Verifiseringsressurser

# Version %@ (%@)
source: Version %1$@ (%2$@)
nb: Versjon %1$@ (%2$@)

source: Version %@ is available!
nb: Versjon %@ er tilgjengelig

source: Video encoder: %@
nb: Videokoder: %@

source: Video Files
nb: Videofiler

source: Video Multi-Method Assessment Fusion, developed by Netflix. Predicts perceived quality on a 0-100 scale. Scores above 93 are considered excellent.
nb: Video Multi-Method Assessment Fusion, utviklet av Netflix. Anslår opplevd kvalitet på en skala fra 0 til 100. Resultater over 93 regnes som svært gode.

source: Video profile: %@
nb: Videoprofil: %@

source: VideoLoop is not recommended for card ingest.
nb: VideoLoop anbefales ikke for kortimport.

source: VideoLoop with sound
nb: VideoLoop med lyd

source: Vision did not report any supported languages on this system.
nb: Vision rapporterte ingen støttede språk på dette systemet.

source: Visually lossless ProRes 4444 for grading. Variable frame rate (VFR) keeps files smaller when the screen is static. Not flagged as a growing clip, so DaVinci Resolve won't poll it for updates while recording — best for importing afterward.
nb: Visuelt tapsfri ProRes 4444 for fargekorrigering. Variabel bildefrekvens (VFR) gir mindre filer når skjermen er statisk. Klippet er ikke merket som voksende, så DaVinci Resolve ser ikke etter oppdateringer under opptak – best egnet for import etterpå.

source: VMAF 4K v0.6.1 (4K content)
nb: VMAF 4K v0.6.1 (4K-innhold)

source: VMAF Model
nb: VMAF-modell

source: VMAF Settings
nb: VMAF-innstillinger

source: VMAF v0.6.1 (Default)
nb: VMAF v0.6.1 (standard)

source: VMAF v0.6.1neg (No Enhancement Gain)
nb: VMAF v0.6.1neg (uten gevinst fra bildeforbedring)

source: Waiting for frames...
nb: Venter på bilderammer…

source: Waveform
nb: Lydbølge

source: Waveform height
nb: Bølgeformhøyde

source: Waveform unavailable
nb: Bølgeform utilgjengelig

source: Weekly
nb: Ukentlig

source: When disabled, output filenames will not include preset-specific suffixes.
nb: Når deaktivert, vil ikke utdatafilnavn inkludere forhåndsinnstillingsspesifikke suffikser.

source: When disabled, resetting only changes the item back to waiting status, preserving trim, crop, and audio routing settings. Hold Option to also clear all settings.
nb: Når dette er slått av, endrer Tilbakestill bare elementet tilbake til ventestatus og beholder trim-, beskjærings- og lydrutingsinnstillinger. Hold Option for også å fjerne alle innstillinger.

source: When disabled, this preset will be hidden from the preset picker
nb: Når deaktivert vil denne forhåndsinnstillingen være skjult fra forhåndsinnillingsvelgeren

source: When enabled (recommended), the encoder removes existing grain before compressing and recreates it during playback — producing smaller files with no visible quality loss. When disabled, the original grain is kept in the encoded bitstream and additional synthesized grain is layered on top, which can look heavier than the original.
nb: Når dette er slått på (anbefalt), fjerner koderen eksisterende korn før komprimering og gjenskaper det under avspilling – det gir mindre filer uten synlig kvalitetstap. Når det er av, beholdes det opprinnelige kornet i den kodede bitstrømmen, og ekstra syntetisert korn legges på toppen, noe som kan se tyngre ut enn originalen.

source: When enabled, audio track routing will be applied to files using this preset
nb: Når aktivert, vil lydsporrutning bli brukt på filer som bruker denne forhåndsinnstillingen

source: When enabled, crop settings will be applied to files using this preset
nb: Når aktivert, vil beskjæringsinnstillinger bli brukt på filer som bruker denne forhåndsinnstillingen

source: When enabled, new downloads will automatically start encoding after the download completes.
nb: Når aktivert, vil nye nedlastinger automatisk starte koding etter at nedlastingen er fullført.

source: When enabled, new downloads will be uploaded after encoding completes. Requires upload to be configured in Settings > Upload.
nb: Når aktivert, vil nye nedlastinger bli lastet opp etter at kodingen er fullført. Krever at opplasting er konfigurert i Innstillinger > Opplasting.

source: When enabled, new files will be muted automatically when VideoLoop is selected
nb: Når aktivert, vil nye filer bli dempet automatisk når VideoLoop er valgt

source: When enabled, new items added to the queue will automatically upload after conversion.
nb: Når aktivert, vil nye elementer som legges til i køen lastes opp automatisk etter konvertering.

source: When enabled, new video files added to the queue will have subtitle generation enabled automatically.
nb: Når aktivert, vil nye videofiler som legges til i køen automatisk få generering av undertekster slått på.

source: When enabled, newly added audio-only files will generate waveform videos unless disabled per item.
nb: Når dette er aktivert, vil nylig tillagte filer som kun inneholder lyd generere bølgeformvideoer, med mindre det deaktiveres for det enkelte element.

source: When enabled, preset suffixes like '_loop' or '_tv' are added to output filenames
nb: Når aktivert, blir forhåndsdefinerte suffikser som «_loop» eller «_tv» lagt til i utdatafilnavn.

source: When enabled, quality analytics will run on each file immediately after encoding completes.
nb: Når dette er slått på, kjøres kvalitetsanalyse på hver fil umiddelbart etter at kodingen er ferdig.

source: When enabled, resetting an item will clear all settings (trim points, crop, audio routing, timecode). Hold Option to only reset the encoding status.
nb: Når dette er slått på, vil Tilbakestill fjerne alle innstillinger (trim-punkter, beskjæring, lydruting, tidskode). Hold Option for kun å tilbakestille kodestatus.

source: When enabled, spaces and special characters in filenames are sanitized
nb: Når aktivert, blir mellomrom og spesialtegn i filnavn sanert

source: When enabled, the generated SRT will be muxed into the output video file as a subtitle track after transcription completes. The external SRT file is kept as well.
nb: Når dette er slått på, bygges den genererte SRT-filen inn i utdata-videofilen som et undertekstspor etter at transkripsjonen er ferdig. Den eksterne SRT-filen beholdes også.

source: When enabled, the original file's metadata is kept intact during conversion
nb: Når aktivert vil konverteringen prøve å beholde original metadata.

source: When enabled, the signed helper accepts requests from local MCP clients and sends them to this app. The app remains the owner of every accepted conversion.
nb: Når dette er aktivert, tar det signerte hjelpeverktøyet imot forespørsler fra lokale MCP-klienter og sender dem til denne appen. Appen forblir eier av hver godkjente konvertering.

source: When enabled, this Mac sends one random weekly token at most once per day when the app opens. It contains no files, paths, media, conversion, account, hardware, or OS details. This counts active installations, not people.
nb: Når dette er slått på, sender denne Macen én tilfeldig ukentlig kode høyst én gang per dag når appen åpnes. Den inneholder ingen filer, filbaner, medier, konverteringer, kontoopplysninger, maskinvare- eller OS-detaljer. Dette teller aktive installasjoner, ikke personer.

source: When enabled, Watch Folder Mode starts automatically every time the app launches.
nb: Når dette er på, starter Watch Folder-modus automatisk hver gang appen starter.

source: When enabled, yt-dlp will rewind live streams to the beginning before recording
nb: Når dette er aktivert, spoler yt-dlp direktesendinger tilbake til starten før opptak

source: When Watch Folder Mode is enabled in the toolbar, the app will automatically scan this folder every 5 seconds for new video files and add them to the conversion queue.
nb: Når Watch Folder Mode er aktivert i verktøylinjen, vil appen automatisk scanne mappen for nye filer hvert 5 sekund og legge dem til i konverteringskøen.

source: Whisper (FFmpeg built-in)
nb: Whisper (innebygd i FFmpeg)

source: whisper.cpp (Subtitle Generation)
nb: whisper.cpp (Undertekst generering)

source: whisper.cpp is a high-performance C++ implementation of OpenAI's Whisper speech recognition model. It can transcribe audio in multiple languages and generate SRT subtitle files.
nb: whisper.cpp er en høytytende C++-implementering av OpenAIs Whisper-modell for talegjenkjenning. Den kan transkribere lyd på flere språk og generere SRT-tekstfiler.

source: whisper.cpp not available
nb: whisper.cpp ikke tilgjengelig
